In [31]:
import pandas as pd
import sqlite3

df = pd.read_csv('/kaggle/input/day-12-hotel-bookings/day_12_hotel_bookings.csv')
conn = sqlite3.connect(':memory:')
df.to_sql('bookings', conn, index=False, if_exists='replace')

38

In [32]:
pd.read_sql("SELECT * FROM bookings LIMIT 5;", conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,1,Aarav Sharma,Delhi,The Imperial,Deluxe,North,Jan,3,4500,13500
1,2,Meera Iyer,Chennai,ITC Grand,Suite,South,Jan,2,6200,12400
2,3,Rohan Gupta,Mumbai,Taj Lands End,Deluxe,West,Jan,4,5500,22000
3,4,Simran Kaur,Amritsar,Hyatt Regency,Standard,North,Feb,2,3200,6400
4,5,Aditya Singh,Jaipur,Rambagh Palace,Suite,North,Feb,3,9000,27000

**All bookings from Delhi**

In [33]:
query = """
SELECT *
FROM bookings
WHERE city = 'Delhi';
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,1,Aarav Sharma,Delhi,The Imperial,Deluxe,North,Jan,3,4500,13500
1,11,Rahul Jain,Delhi,The Lalit,Standard,North,Apr,1,2800,2800
2,15,Mohit Bansal,Delhi,Radisson Blu,Deluxe,North,May,3,4900,14700
3,19,Nikhil Verma,Delhi,Roseate House,Suite,North,Jul,3,8800,26400
4,25,Kunal Arora,Delhi,Vivanta,Deluxe,North,Sep,2,5200,10400
5,31,Manish Gupta,Delhi,Hotel Ashok,Standard,North,Nov,1,2500,2500
6,34,Tanya Kapoor,Delhi,Pullman Aerocity,Suite,North,Dec,3,8900,26700

**All Suite room bookings**

In [34]:
query = """
SELECT *
FROM bookings
WHERE room_type = 'Suite';
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,2,Meera Iyer,Chennai,ITC Grand,Suite,South,Jan,2,6200,12400
1,5,Aditya Singh,Jaipur,Rambagh Palace,Suite,North,Feb,3,9000,27000
2,9,Vikram Rao,Bangalore,The Leela Palace,Suite,South,Mar,2,7800,15600
3,12,Sneha Patil,Mumbai,Taj Mahal Palace,Suite,West,Apr,3,9200,27600
4,16,Zoya Khan,Mumbai,St Regis,Suite,West,Jun,2,10500,21000
5,19,Nikhil Verma,Delhi,Roseate House,Suite,North,Jul,3,8800,26400
6,24,Nandita Bose,Kolkata,The Oberoi Grand,Suite,East,Aug,2,7600,15200
7,27,Rohit Naik,Goa,W Goa,Suite,West,Sep,2,9800,19600
8,30,Bhavya Jain,Udaipur,The Oberoi Udaivilas,Suite,North,Oct,2,15000,30000
9,34,Tanya Kapoor,Delhi,Pullman Aerocity,Suite,North,Dec,3,8900,26700
10,36,Anjali Singh,Varanasi,BrijRama Palace,Suite,North,Dec,2,11200,22400

**Bookings where total_amount > 15000**

In [35]:
query = """
SELECT *
FROM bookings
WHERE total_amount > 15000;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,3,Rohan Gupta,Mumbai,Taj Lands End,Deluxe,West,Jan,4,5500,22000
1,5,Aditya Singh,Jaipur,Rambagh Palace,Suite,North,Feb,3,9000,27000
2,8,Pooja Nair,Kochi,Brunton Boatyard,Deluxe,South,Mar,3,5100,15300
3,9,Vikram Rao,Bangalore,The Leela Palace,Suite,South,Mar,2,7800,15600
4,10,Ananya Das,Kolkata,ITC Sonar,Deluxe,East,Apr,4,4600,18400
5,12,Sneha Patil,Mumbai,Taj Mahal Palace,Suite,West,Apr,3,9200,27600
6,16,Zoya Khan,Mumbai,St Regis,Suite,West,Jun,2,10500,21000
7,19,Nikhil Verma,Delhi,Roseate House,Suite,North,Jul,3,8800,26400
8,24,Nandita Bose,Kolkata,The Oberoi Grand,Suite,East,Aug,2,7600,15200
9,27,Rohit Naik,Goa,W Goa,Suite,West,Sep,2,9800,19600
10,28,Alisha D'Souza,Goa,Taj Fort Aguada,Deluxe,West,Oct,3,6700,20100
11,30,Bhavya Jain,Udaipur,The Oberoi Udaivilas,Suite,North,Oct,2,15000,30000
12,34,Tanya Kapoor,Delhi,Pullman Aerocity,Suite,North,Dec,3,8900,26700
13,36,Anjali Singh,Varanasi,BrijRama Palace,Suite,North,Dec,2,11200,22400

**Top 5 most expensive bookings**

In [36]:
query = """
SELECT *
FROM bookings
ORDER BY total_amount DESC
LIMIT 5 ;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,30,Bhavya Jain,Udaipur,The Oberoi Udaivilas,Suite,North,Oct,2,15000,30000
1,12,Sneha Patil,Mumbai,Taj Mahal Palace,Suite,West,Apr,3,9200,27600
2,5,Aditya Singh,Jaipur,Rambagh Palace,Suite,North,Feb,3,9000,27000
3,34,Tanya Kapoor,Delhi,Pullman Aerocity,Suite,North,Dec,3,8900,26700
4,19,Nikhil Verma,Delhi,Roseate House,Suite,North,Jul,3,8800,26400

**Cheapest 5 bookings**

In [37]:
query = """
SELECT *
FROM bookings
ORDER BY total_amount ASC
LIMIT 5 ;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,31,Manish Gupta,Delhi,Hotel Ashok,Standard,North,Nov,1,2500,2500
1,17,Ritwik Sen,Kolkata,Pride Plaza,Standard,East,Jun,1,2600,2600
2,11,Rahul Jain,Delhi,The Lalit,Standard,North,Apr,1,2800,2800
3,23,Amanpreet Singh,Ludhiana,Radisson Blu,Standard,North,Aug,1,2900,2900
4,21,Suresh Pillai,Kochi,Taj Malabar,Standard,South,Jul,1,3000,3000

**Top 3 longest stays**

In [38]:
query = """
SELECT *
FROM bookings
ORDER BY nights DESC
LIMIT 3 ;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,3,Rohan Gupta,Mumbai,Taj Lands End,Deluxe,West,Jan,4,5500,22000
1,10,Ananya Das,Kolkata,ITC Sonar,Deluxe,East,Apr,4,4600,18400
2,1,Aarav Sharma,Delhi,The Imperial,Deluxe,North,Jan,3,4500,13500

**Hotels containing 'Taj'**

In [39]:
query = """
SELECT *
FROM bookings
WHERE hotel_name LIKE '%Taj%' ;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,3,Rohan Gupta,Mumbai,Taj Lands End,Deluxe,West,Jan,4,5500,22000
1,12,Sneha Patil,Mumbai,Taj Mahal Palace,Suite,West,Apr,3,9200,27600
2,20,Isha Kapoor,Chandigarh,Taj Chandigarh,Deluxe,North,Jul,2,5300,10600
3,21,Suresh Pillai,Kochi,Taj Malabar,Standard,South,Jul,1,3000,3000
4,28,Alisha D'Souza,Goa,Taj Fort Aguada,Deluxe,West,Oct,3,6700,20100
5,32,Shreya Ghoshal,Mumbai,Taj Santacruz,Deluxe,West,Nov,2,6100,12200

**Customer names starting with 'K'**

In [40]:
query = """
SELECT *
FROM bookings
WHERE customer_name LIKE 'K%' ;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,7,Kabir Mehta,Ahmedabad,Courtyard Marriott,Standard,West,Mar,2,3500,7000
1,14,Kavya Menon,Trivandrum,Hycinth Hotels,Standard,South,May,2,3100,6200
2,25,Kunal Arora,Delhi,Vivanta,Deluxe,North,Sep,2,5200,10400

**Cities IN ('Delhi','Mumbai','Goa')**

In [41]:
query = """
SELECT *
FROM bookings
WHERE city IN ('Delhi', 'Mumbai', 'Goa') ;
"""

pd.read_sql(query, conn)

,booking_id,customer_name,city,hotel_name,room_type,region,booking_month,nights,price_per_night,total_amount
0,1,Aarav Sharma,Delhi,The Imperial,Deluxe,North,Jan,3,4500,13500
1,3,Rohan Gupta,Mumbai,Taj Lands End,Deluxe,West,Jan,4,5500,22000
2,11,Rahul Jain,Delhi,The Lalit,Standard,North,Apr,1,2800,2800
3,12,Sneha Patil,Mumbai,Taj Mahal Palace,Suite,West,Apr,3,9200,27600
4,15,Mohit Bansal,Delhi,Radisson Blu,Deluxe,North,May,3,4900,14700
5,16,Zoya Khan,Mumbai,St Regis,Suite,West,Jun,2,10500,21000
6,19,Nikhil Verma,Delhi,Roseate House,Suite,North,Jul,3,8800,26400
7,22,Riya Shah,Mumbai,Novotel Juhu,Deluxe,West,Aug,2,4700,9400
8,25,Kunal Arora,Delhi,Vivanta,Deluxe,North,Sep,2,5200,10400
9,27,Rohit Naik,Goa,W Goa,Suite,West,Sep,2,9800,19600
10,28,Alisha D'Souza,Goa,Taj Fort Aguada,Deluxe,West,Oct,3,6700,20100
11,31,Manish Gupta,Delhi,Hotel Ashok,Standard,North,Nov,1,2500,2500
12,32,Shreya Ghoshal,Mumbai,Taj Santacruz,Deluxe,West,Nov,2,6100,12200
13,34,Tanya Kapoor,Delhi,Pullman Aerocity,Suite,North,Dec,3,8900,26700
14,37,Rajat Malhotra,Mumbai,Trident Nariman,Standard,West,Dec,1,3100,3100

**Total revenue**

In [42]:
query = """
SELECT SUM(total_amount) as Total_Revenue
FROM bookings ;
"""

pd.read_sql(query, conn)

   Total_Revenue
0         505000

**Average booking value**

In [43]:
query = """
SELECT AVG(total_amount) as Average_amount
FROM bookings
;
"""

pd.read_sql(query, conn)

   Average_amount
0    13289.473684

**Total bookings count**

In [44]:
query = """
SELECT COUNT(*) as Bookings_count
FROM bookings
 ;
"""

pd.read_sql(query, conn)

   Bookings_count
0              38

> monthly revenue

In [45]:
query = """
SELECT booking_month, SUM(total_amount) AS monthly_revenue
FROM bookings
GROUP BY booking_month
ORDER BY monthly_revenue DESC;
"""

pd.read_sql(query, conn)

   booking_month  monthly_revenue
0            Dec            72600
1            Oct            61900
2            Apr            48800
3            Jan            47900
4            Sep            40200
5            Jul            40000
6            Feb            38200
7            Mar            37900
8            Jun            35800
9            May            32100
10           Aug            27500
11           Nov            22100

> revenue per region

In [46]:
query = """
SELECT region, SUM(total_amount) AS revenue
FROM bookings
GROUP BY region
ORDER BY revenue DESC;
"""

pd.read_sql(query, conn)

  region  revenue
0  North   216100
1   West   169800
2  South    71100
3   East    48000

> monthly revenue per region

In [47]:
query = """
SELECT region, booking_month, SUM(total_amount) AS revenue
FROM bookings
GROUP BY region, booking_month
ORDER BY region, booking_month;
"""

pd.read_sql(query, conn)

   region booking_month  revenue
0    East           Apr    18400
1    East           Aug    15200
2    East           Jun     2600
3    East           Oct    11800
4   North           Apr     2800
5   North           Aug     2900
6   North           Dec    58700
7   North           Feb    33400
8   North           Jan    13500
9   North           Jul    37000
10  North           May    14700
11  North           Nov     2500
12  North           Oct    30000
13  North           Sep    20600
14  South           Jan    12400
15  South           Jul     3000
16  South           Mar    30900
17  South           May    17400
18  South           Nov     7400
19   West           Apr    27600
20   West           Aug     9400
21   West           Dec    13900
22   West           Feb     4800
23   West           Jan    22000
24   West           Jun    33200
25   West           Mar     7000
26   West           Nov    12200
27   West           Oct    20100
28   West           Sep    19600

> -- filter groups example

In [48]:
query = """
SELECT region, booking_month, SUM(total_amount) AS revenue
FROM bookings
GROUP BY region, booking_month
HAVING SUM(total_amount) > 50000
ORDER BY revenue DESC; 
"""

pd.read_sql(query, conn)

  region booking_month  revenue
0  North           Dec    58700